
import re
"""
---------------------------------------------------------------------
1 将给定字符串的PHP替换为Python      
best_language = "PHP is the best programming language in the world! "
---------------------------------------------------------------------
"""
best_language = "PHP is the best programming language in the world! "
print(best_language.replace("PHP", "Python"))


"""
---------------------------------------------------------------------
2 编写代码，提示用户输入1-7七个数字，分别代表周一到周日，打印输出“今天是周几”
---------------------------------------------------------------------
"""
week = {'1': "一", '2': "二", '3': "三", '4': "四", '5': "五", '6': "六", '7': "七"}
weekDay = input("输入1-7七个数字：")
st = "今天是周*"
print(st.replace("*", week[weekDay]))


"""
---------------------------------------------------------------------
3 给定一个字符串： Python is the BEST programming Language！
编写一个正则表达式用来判断该字符串是否全部为小写。
---------------------------------------------------------------------
"""
st = "Python is the BEST programming Language！"
print(st)
if re.search('^[a-z]+$', st):
    print("\n是全部小写\n")
else:
    print("\n不是全部小写\n")


""" 
---------------------------------------------------------------------
4  读取一个字符串，要求使用正则表达式来读取其中的电话号码，电话号码的格式假定为：
（xxx） xxx-xxxx或xxx-xxx-xxxx。
---------------------------------------------------------------------
"""

st = input("请输入：")

li1 = re.findall(r'\(\d{3}\)\d{3}-\d{4}', st)
li2 = re.findall(r'\d{3}-\d{3}-\d{4}', st)
li = li1 + li2
for i in li:
    print(i)

"""
++++++++++++++++++++++++++++++++++++++++++++++++++++
run:
请输入：(123)123-1234test122-123-1234test012-022-0321
(123)123-1234
122-123-1234
012-022-0321
++++++++++++++++++++++++++++++++++++++++++++++++++++
"""


"""
---------------------------------------------------------------------
5 利用正则表达式从下列不同的字符串中获取指定格式的日期。日期的格式为yyyy-mm-dd。

'今天是2022/9/24', '今天是2017/09/25', '今天是2012-07-25', '今天是2020年04月25',
---------------------------------------------------------------------
"""
stList = {'今天是2022/9/24', '今天是2017/09/25', '今天是2012-07-25', '今天是2020年04月25'}

for stI in stList:
    li = re.findall(r'\d{4}[\-,/,年]\d{1,2}[\-,/,月]\d{1,2}', stI)
    for i in li:
        print(i)

"""
++++++++++++++++++++++++++++++++++++++++++++++++++++
run:
2022/9/24
2012-07-25
2017/09/25
2020年04月25
++++++++++++++++++++++++++++++++++++++++++++++++++++
"""
