import random


class Heroes:
    def __init__(self, name, level, max_health, race, agility):
        self.name = name

        if int(level) < 1:
            self.level = 1
        else:
            self.level = int(level)

        self.health = max_health
        self.max_health = max_health
        self.race = race

        if agility < 0:
            self.agility = 0

        elif agility > 1:
            self.agility = 1

        else:
            self.agility = agility

    def attack(self):
        damage = random.randint(0, self.level * 10 - 1)
        print("{", self.name, "}发起了 ", damage, " 点攻击", sep="")
        return damage

    def defense(self, hurt):
        if self.agility > random.randint(0, 10) / 10:
            print("{", self.name, "}受到了 0 点伤害，当前血量为 ", self.health, sep="")
        else:
            self.health -= hurt
            print("{", self.name, "}受到了 ", hurt, " 点伤害，当前血量为 ", self.health, sep="")


class Monsters:
    def __init__(self, name, level, race):
        self.name = name

        if int(level) < 1:
            self.level = 1
        else:
            self.level = int(level)

        self.health = self.level * 100
        self.max_health = self.level * 100

        if int(level) >= 3:
            self.armor = 100
        else:
            self.armor = 0

        self.race = race

    def attack(self):
        damage = random.randint(0, self.level * 10 - 1)
        print("{", self.name, "}发起了 ", damage, " 点攻击", sep="")
        return damage

    def defense(self, hurt):
        if hurt >= 0:
            if self.armor <= 0:
                self.health -= hurt
                print("{", self.name, "}受到了 ", hurt, " 点伤害，当前血量为 ", self.health, sep="")

            elif self.armor >= hurt:
                self.armor -= hurt
                print("{", self.name, "}受到了 ", hurt, " 点伤害，当前血量为 ", self.health, " ，当前护甲为 ", self.armor, sep="")

            else:
                self.armor -= hurt
                self.health = self.health + self.armor
                print("{", self.name, "}受到了 ", hurt, " 点伤害，当前血量为 ", self.health, sep="")

        else:
            print("{", self.name, "}受到了 0 点伤害，当前血量为 ", self.health, sep="")


def main():
    player1 = Heroes("枪手", 1, 150, "Dwarfs", 0.3)
    player2 = Heroes("工程兵", 1, 125, "Dwarfs", 0.2)
    player3 = Heroes("钻机手", 1, 150, "Dwarfs", 0.5)
    player4 = Heroes("侦察兵", 1, 100, "Dwarfs", 0.8)
    monster1 = Monsters("战士异虫", 1, "Bugs")
    monster2 = Monsters("刀锋异虫", 2, "Bugs")
    monster3 = Monsters("大自爆虫", 3, "Bugs")

    players = [player1, player2, player3, player4]
    monsters = [monster1, monster2, monster3]
    rounds = 0

    while len(monsters) > 0 and len(players) > 0:
        rounds += 1
        print("第 ", rounds, " 回合 ---------------------------------------------", sep="")

        monsters[0].defense(players[0].attack())
        if monsters[0].health <= 0:
            print("{", monsters[0].name, "}死亡了！", sep="")
            monsters.pop(0)
            if len(monsters) == 0:
                break

            if players[0].level < 3:
                players[0].level += 1
                players[0].health = players[0].max_health
                print("{", players[0].name, "}升级，当前等级为 ", players[0].level, " ，当前血量为 ", players[0].health, sep="")
            else:
                players[0].health = players[0].max_health
                print("{", players[0].name, "}已达满级，当前血量为 ", players[0].health, sep="")

        players[0].defense(monsters[0].attack())
        if players[0].health <= 0:
            print("{", players[0].name, "}倒地了！", sep="")
            players.pop(0)
            if len(players) == 0:
                break

        print("")

    print("")
    if len(players) == 0:
        print("Lose！")

    if len(monsters) == 0:
        print("Win！")


if __name__ == '__main__':
    main()


'''运行结果：
第 1 回合 ---------------------------------------------
{枪手}发起了 9 点攻击
{战士异虫}受到了 9 点伤害，当前血量为 91
{战士异虫}发起了 3 点攻击
{枪手}受到了 0 点伤害，当前血量为 150

第 2 回合 ---------------------------------------------
{枪手}发起了 6 点攻击
{战士异虫}受到了 6 点伤害，当前血量为 85
{战士异虫}发起了 9 点攻击
{枪手}受到了 9 点伤害，当前血量为 141

第 3 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{战士异虫}受到了 0 点伤害，当前血量为 85
{战士异虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 141

第 4 回合 ---------------------------------------------
{枪手}发起了 1 点攻击
{战士异虫}受到了 1 点伤害，当前血量为 84
{战士异虫}发起了 8 点攻击
{枪手}受到了 8 点伤害，当前血量为 133

第 5 回合 ---------------------------------------------
{枪手}发起了 1 点攻击
{战士异虫}受到了 1 点伤害，当前血量为 83
{战士异虫}发起了 1 点攻击
{枪手}受到了 1 点伤害，当前血量为 132

第 6 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{战士异虫}受到了 7 点伤害，当前血量为 76
{战士异虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 132

第 7 回合 ---------------------------------------------
{枪手}发起了 4 点攻击
{战士异虫}受到了 4 点伤害，当前血量为 72
{战士异虫}发起了 1 点攻击
{枪手}受到了 1 点伤害，当前血量为 131

第 8 回合 ---------------------------------------------
{枪手}发起了 9 点攻击
{战士异虫}受到了 9 点伤害，当前血量为 63
{战士异虫}发起了 2 点攻击
{枪手}受到了 2 点伤害，当前血量为 129

第 9 回合 ---------------------------------------------
{枪手}发起了 4 点攻击
{战士异虫}受到了 4 点伤害，当前血量为 59
{战士异虫}发起了 5 点攻击
{枪手}受到了 5 点伤害，当前血量为 124

第 10 回合 ---------------------------------------------
{枪手}发起了 6 点攻击
{战士异虫}受到了 6 点伤害，当前血量为 53
{战士异虫}发起了 3 点攻击
{枪手}受到了 3 点伤害，当前血量为 121

第 11 回合 ---------------------------------------------
{枪手}发起了 2 点攻击
{战士异虫}受到了 2 点伤害，当前血量为 51
{战士异虫}发起了 8 点攻击
{枪手}受到了 8 点伤害，当前血量为 113

第 12 回合 ---------------------------------------------
{枪手}发起了 4 点攻击
{战士异虫}受到了 4 点伤害，当前血量为 47
{战士异虫}发起了 4 点攻击
{枪手}受到了 4 点伤害，当前血量为 109

第 13 回合 ---------------------------------------------
{枪手}发起了 3 点攻击
{战士异虫}受到了 3 点伤害，当前血量为 44
{战士异虫}发起了 9 点攻击
{枪手}受到了 9 点伤害，当前血量为 100

第 14 回合 ---------------------------------------------
{枪手}发起了 6 点攻击
{战士异虫}受到了 6 点伤害，当前血量为 38
{战士异虫}发起了 2 点攻击
{枪手}受到了 2 点伤害，当前血量为 98

第 15 回合 ---------------------------------------------
{枪手}发起了 8 点攻击
{战士异虫}受到了 8 点伤害，当前血量为 30
{战士异虫}发起了 8 点攻击
{枪手}受到了 0 点伤害，当前血量为 98

第 16 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{战士异虫}受到了 0 点伤害，当前血量为 30
{战士异虫}发起了 9 点攻击
{枪手}受到了 0 点伤害，当前血量为 98

第 17 回合 ---------------------------------------------
{枪手}发起了 1 点攻击
{战士异虫}受到了 1 点伤害，当前血量为 29
{战士异虫}发起了 9 点攻击
{枪手}受到了 0 点伤害，当前血量为 98

第 18 回合 ---------------------------------------------
{枪手}发起了 1 点攻击
{战士异虫}受到了 1 点伤害，当前血量为 28
{战士异虫}发起了 3 点攻击
{枪手}受到了 0 点伤害，当前血量为 98

第 19 回合 ---------------------------------------------
{枪手}发起了 9 点攻击
{战士异虫}受到了 9 点伤害，当前血量为 19
{战士异虫}发起了 9 点攻击
{枪手}受到了 9 点伤害，当前血量为 89

第 20 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{战士异虫}受到了 7 点伤害，当前血量为 12
{战士异虫}发起了 1 点攻击
{枪手}受到了 1 点伤害，当前血量为 88

第 21 回合 ---------------------------------------------
{枪手}发起了 2 点攻击
{战士异虫}受到了 2 点伤害，当前血量为 10
{战士异虫}发起了 4 点攻击
{枪手}受到了 4 点伤害，当前血量为 84

第 22 回合 ---------------------------------------------
{枪手}发起了 8 点攻击
{战士异虫}受到了 8 点伤害，当前血量为 2
{战士异虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 84

第 23 回合 ---------------------------------------------
{枪手}发起了 1 点攻击
{战士异虫}受到了 1 点伤害，当前血量为 1
{战士异虫}发起了 4 点攻击
{枪手}受到了 4 点伤害，当前血量为 80

第 24 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{战士异虫}受到了 7 点伤害，当前血量为 -6
{战士异虫}死亡了！
{枪手}升级，当前等级为 2 ，当前血量为 150
{刀锋异虫}发起了 5 点攻击
{枪手}受到了 0 点伤害，当前血量为 150

第 25 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{刀锋异虫}受到了 0 点伤害，当前血量为 200
{刀锋异虫}发起了 10 点攻击
{枪手}受到了 10 点伤害，当前血量为 140

第 26 回合 ---------------------------------------------
{枪手}发起了 8 点攻击
{刀锋异虫}受到了 8 点伤害，当前血量为 192
{刀锋异虫}发起了 10 点攻击
{枪手}受到了 0 点伤害，当前血量为 140

第 27 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{刀锋异虫}受到了 0 点伤害，当前血量为 192
{刀锋异虫}发起了 5 点攻击
{枪手}受到了 5 点伤害，当前血量为 135

第 28 回合 ---------------------------------------------
{枪手}发起了 17 点攻击
{刀锋异虫}受到了 17 点伤害，当前血量为 175
{刀锋异虫}发起了 9 点攻击
{枪手}受到了 9 点伤害，当前血量为 126

第 29 回合 ---------------------------------------------
{枪手}发起了 5 点攻击
{刀锋异虫}受到了 5 点伤害，当前血量为 170
{刀锋异虫}发起了 5 点攻击
{枪手}受到了 5 点伤害，当前血量为 121

第 30 回合 ---------------------------------------------
{枪手}发起了 17 点攻击
{刀锋异虫}受到了 17 点伤害，当前血量为 153
{刀锋异虫}发起了 18 点攻击
{枪手}受到了 0 点伤害，当前血量为 121

第 31 回合 ---------------------------------------------
{枪手}发起了 14 点攻击
{刀锋异虫}受到了 14 点伤害，当前血量为 139
{刀锋异虫}发起了 10 点攻击
{枪手}受到了 0 点伤害，当前血量为 121

第 32 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{刀锋异虫}受到了 7 点伤害，当前血量为 132
{刀锋异虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 121

第 33 回合 ---------------------------------------------
{枪手}发起了 4 点攻击
{刀锋异虫}受到了 4 点伤害，当前血量为 128
{刀锋异虫}发起了 1 点攻击
{枪手}受到了 1 点伤害，当前血量为 120

第 34 回合 ---------------------------------------------
{枪手}发起了 16 点攻击
{刀锋异虫}受到了 16 点伤害，当前血量为 112
{刀锋异虫}发起了 12 点攻击
{枪手}受到了 12 点伤害，当前血量为 108

第 35 回合 ---------------------------------------------
{枪手}发起了 11 点攻击
{刀锋异虫}受到了 11 点伤害，当前血量为 101
{刀锋异虫}发起了 11 点攻击
{枪手}受到了 0 点伤害，当前血量为 108

第 36 回合 ---------------------------------------------
{枪手}发起了 10 点攻击
{刀锋异虫}受到了 10 点伤害，当前血量为 91
{刀锋异虫}发起了 12 点攻击
{枪手}受到了 12 点伤害，当前血量为 96

第 37 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{刀锋异虫}受到了 7 点伤害，当前血量为 84
{刀锋异虫}发起了 2 点攻击
{枪手}受到了 0 点伤害，当前血量为 96

第 38 回合 ---------------------------------------------
{枪手}发起了 12 点攻击
{刀锋异虫}受到了 12 点伤害，当前血量为 72
{刀锋异虫}发起了 13 点攻击
{枪手}受到了 13 点伤害，当前血量为 83

第 39 回合 ---------------------------------------------
{枪手}发起了 2 点攻击
{刀锋异虫}受到了 2 点伤害，当前血量为 70
{刀锋异虫}发起了 15 点攻击
{枪手}受到了 15 点伤害，当前血量为 68

第 40 回合 ---------------------------------------------
{枪手}发起了 8 点攻击
{刀锋异虫}受到了 8 点伤害，当前血量为 62
{刀锋异虫}发起了 15 点攻击
{枪手}受到了 15 点伤害，当前血量为 53

第 41 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{刀锋异虫}受到了 0 点伤害，当前血量为 62
{刀锋异虫}发起了 17 点攻击
{枪手}受到了 0 点伤害，当前血量为 53

第 42 回合 ---------------------------------------------
{枪手}发起了 2 点攻击
{刀锋异虫}受到了 2 点伤害，当前血量为 60
{刀锋异虫}发起了 14 点攻击
{枪手}受到了 14 点伤害，当前血量为 39

第 43 回合 ---------------------------------------------
{枪手}发起了 16 点攻击
{刀锋异虫}受到了 16 点伤害，当前血量为 44
{刀锋异虫}发起了 11 点攻击
{枪手}受到了 11 点伤害，当前血量为 28

第 44 回合 ---------------------------------------------
{枪手}发起了 15 点攻击
{刀锋异虫}受到了 15 点伤害，当前血量为 29
{刀锋异虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 28

第 45 回合 ---------------------------------------------
{枪手}发起了 5 点攻击
{刀锋异虫}受到了 5 点伤害，当前血量为 24
{刀锋异虫}发起了 5 点攻击
{枪手}受到了 5 点伤害，当前血量为 23

第 46 回合 ---------------------------------------------
{枪手}发起了 18 点攻击
{刀锋异虫}受到了 18 点伤害，当前血量为 6
{刀锋异虫}发起了 13 点攻击
{枪手}受到了 13 点伤害，当前血量为 10

第 47 回合 ---------------------------------------------
{枪手}发起了 6 点攻击
{刀锋异虫}受到了 6 点伤害，当前血量为 0
{刀锋异虫}死亡了！
{枪手}升级，当前等级为 3 ，当前血量为 150
{大自爆虫}发起了 0 点攻击
{枪手}受到了 0 点伤害，当前血量为 150

第 48 回合 ---------------------------------------------
{枪手}发起了 25 点攻击
{大自爆虫}受到了 25 点伤害，当前血量为 300 ，当前护甲为 75
{大自爆虫}发起了 18 点攻击
{枪手}受到了 18 点伤害，当前血量为 132

第 49 回合 ---------------------------------------------
{枪手}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 300 ，当前护甲为 69
{大自爆虫}发起了 5 点攻击
{枪手}受到了 0 点伤害，当前血量为 132

第 50 回合 ---------------------------------------------
{枪手}发起了 2 点攻击
{大自爆虫}受到了 2 点伤害，当前血量为 300 ，当前护甲为 67
{大自爆虫}发起了 17 点攻击
{枪手}受到了 0 点伤害，当前血量为 132

第 51 回合 ---------------------------------------------
{枪手}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 300 ，当前护甲为 67
{大自爆虫}发起了 21 点攻击
{枪手}受到了 0 点伤害，当前血量为 132

第 52 回合 ---------------------------------------------
{枪手}发起了 9 点攻击
{大自爆虫}受到了 9 点伤害，当前血量为 300 ，当前护甲为 58
{大自爆虫}发起了 13 点攻击
{枪手}受到了 13 点伤害，当前血量为 119

第 53 回合 ---------------------------------------------
{枪手}发起了 13 点攻击
{大自爆虫}受到了 13 点伤害，当前血量为 300 ，当前护甲为 45
{大自爆虫}发起了 29 点攻击
{枪手}受到了 29 点伤害，当前血量为 90

第 54 回合 ---------------------------------------------
{枪手}发起了 29 点攻击
{大自爆虫}受到了 29 点伤害，当前血量为 300 ，当前护甲为 16
{大自爆虫}发起了 10 点攻击
{枪手}受到了 0 点伤害，当前血量为 90

第 55 回合 ---------------------------------------------
{枪手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 300 ，当前护甲为 12
{大自爆虫}发起了 14 点攻击
{枪手}受到了 14 点伤害，当前血量为 76

第 56 回合 ---------------------------------------------
{枪手}发起了 18 点攻击
{大自爆虫}受到了 18 点伤害，当前血量为 294
{大自爆虫}发起了 4 点攻击
{枪手}受到了 4 点伤害，当前血量为 72

第 57 回合 ---------------------------------------------
{枪手}发起了 20 点攻击
{大自爆虫}受到了 20 点伤害，当前血量为 274
{大自爆虫}发起了 9 点攻击
{枪手}受到了 9 点伤害，当前血量为 63

第 58 回合 ---------------------------------------------
{枪手}发起了 28 点攻击
{大自爆虫}受到了 28 点伤害，当前血量为 246
{大自爆虫}发起了 1 点攻击
{枪手}受到了 1 点伤害，当前血量为 62

第 59 回合 ---------------------------------------------
{枪手}发起了 20 点攻击
{大自爆虫}受到了 20 点伤害，当前血量为 226
{大自爆虫}发起了 23 点攻击
{枪手}受到了 23 点伤害，当前血量为 39

第 60 回合 ---------------------------------------------
{枪手}发起了 17 点攻击
{大自爆虫}受到了 17 点伤害，当前血量为 209
{大自爆虫}发起了 24 点攻击
{枪手}受到了 24 点伤害，当前血量为 15

第 61 回合 ---------------------------------------------
{枪手}发起了 28 点攻击
{大自爆虫}受到了 28 点伤害，当前血量为 181
{大自爆虫}发起了 3 点攻击
{枪手}受到了 0 点伤害，当前血量为 15

第 62 回合 ---------------------------------------------
{枪手}发起了 7 点攻击
{大自爆虫}受到了 7 点伤害，当前血量为 174
{大自爆虫}发起了 22 点攻击
{枪手}受到了 22 点伤害，当前血量为 -7
{枪手}倒地了！

第 63 回合 ---------------------------------------------
{工程兵}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 173
{大自爆虫}发起了 16 点攻击
{工程兵}受到了 16 点伤害，当前血量为 109

第 64 回合 ---------------------------------------------
{工程兵}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 173
{大自爆虫}发起了 24 点攻击
{工程兵}受到了 24 点伤害，当前血量为 85

第 65 回合 ---------------------------------------------
{工程兵}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 167
{大自爆虫}发起了 17 点攻击
{工程兵}受到了 17 点伤害，当前血量为 68

第 66 回合 ---------------------------------------------
{工程兵}发起了 2 点攻击
{大自爆虫}受到了 2 点伤害，当前血量为 165
{大自爆虫}发起了 29 点攻击
{工程兵}受到了 29 点伤害，当前血量为 39

第 67 回合 ---------------------------------------------
{工程兵}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 165
{大自爆虫}发起了 21 点攻击
{工程兵}受到了 21 点伤害，当前血量为 18

第 68 回合 ---------------------------------------------
{工程兵}发起了 9 点攻击
{大自爆虫}受到了 9 点伤害，当前血量为 156
{大自爆虫}发起了 19 点攻击
{工程兵}受到了 19 点伤害，当前血量为 -1
{工程兵}倒地了！

第 69 回合 ---------------------------------------------
{钻机手}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 155
{大自爆虫}发起了 3 点攻击
{钻机手}受到了 3 点伤害，当前血量为 147

第 70 回合 ---------------------------------------------
{钻机手}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 149
{大自爆虫}发起了 22 点攻击
{钻机手}受到了 0 点伤害，当前血量为 147

第 71 回合 ---------------------------------------------
{钻机手}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 149
{大自爆虫}发起了 28 点攻击
{钻机手}受到了 0 点伤害，当前血量为 147

第 72 回合 ---------------------------------------------
{钻机手}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 149
{大自爆虫}发起了 12 点攻击
{钻机手}受到了 0 点伤害，当前血量为 147

第 73 回合 ---------------------------------------------
{钻机手}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 149
{大自爆虫}发起了 20 点攻击
{钻机手}受到了 20 点伤害，当前血量为 127

第 74 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 145
{大自爆虫}发起了 25 点攻击
{钻机手}受到了 25 点伤害，当前血量为 102

第 75 回合 ---------------------------------------------
{钻机手}发起了 7 点攻击
{大自爆虫}受到了 7 点伤害，当前血量为 138
{大自爆虫}发起了 23 点攻击
{钻机手}受到了 0 点伤害，当前血量为 102

第 76 回合 ---------------------------------------------
{钻机手}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 132
{大自爆虫}发起了 5 点攻击
{钻机手}受到了 0 点伤害，当前血量为 102

第 77 回合 ---------------------------------------------
{钻机手}发起了 8 点攻击
{大自爆虫}受到了 8 点伤害，当前血量为 124
{大自爆虫}发起了 23 点攻击
{钻机手}受到了 0 点伤害，当前血量为 102

第 78 回合 ---------------------------------------------
{钻机手}发起了 2 点攻击
{大自爆虫}受到了 2 点伤害，当前血量为 122
{大自爆虫}发起了 29 点攻击
{钻机手}受到了 29 点伤害，当前血量为 73

第 79 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 118
{大自爆虫}发起了 27 点攻击
{钻机手}受到了 0 点伤害，当前血量为 73

第 80 回合 ---------------------------------------------
{钻机手}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 117
{大自爆虫}发起了 1 点攻击
{钻机手}受到了 0 点伤害，当前血量为 73

第 81 回合 ---------------------------------------------
{钻机手}发起了 3 点攻击
{大自爆虫}受到了 3 点伤害，当前血量为 114
{大自爆虫}发起了 28 点攻击
{钻机手}受到了 28 点伤害，当前血量为 45

第 82 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 110
{大自爆虫}发起了 3 点攻击
{钻机手}受到了 0 点伤害，当前血量为 45

第 83 回合 ---------------------------------------------
{钻机手}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 104
{大自爆虫}发起了 10 点攻击
{钻机手}受到了 0 点伤害，当前血量为 45

第 84 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 100
{大自爆虫}发起了 19 点攻击
{钻机手}受到了 0 点伤害，当前血量为 45

第 85 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 96
{大自爆虫}发起了 0 点攻击
{钻机手}受到了 0 点伤害，当前血量为 45

第 86 回合 ---------------------------------------------
{钻机手}发起了 2 点攻击
{大自爆虫}受到了 2 点伤害，当前血量为 94
{大自爆虫}发起了 19 点攻击
{钻机手}受到了 19 点伤害，当前血量为 26

第 87 回合 ---------------------------------------------
{钻机手}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 90
{大自爆虫}发起了 28 点攻击
{钻机手}受到了 0 点伤害，当前血量为 26

第 88 回合 ---------------------------------------------
{钻机手}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 89
{大自爆虫}发起了 7 点攻击
{钻机手}受到了 7 点伤害，当前血量为 19

第 89 回合 ---------------------------------------------
{钻机手}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 88
{大自爆虫}发起了 14 点攻击
{钻机手}受到了 0 点伤害，当前血量为 19

第 90 回合 ---------------------------------------------
{钻机手}发起了 3 点攻击
{大自爆虫}受到了 3 点伤害，当前血量为 85
{大自爆虫}发起了 25 点攻击
{钻机手}受到了 0 点伤害，当前血量为 19

第 91 回合 ---------------------------------------------
{钻机手}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 84
{大自爆虫}发起了 12 点攻击
{钻机手}受到了 12 点伤害，当前血量为 7

第 92 回合 ---------------------------------------------
{钻机手}发起了 3 点攻击
{大自爆虫}受到了 3 点伤害，当前血量为 81
{大自爆虫}发起了 10 点攻击
{钻机手}受到了 10 点伤害，当前血量为 -3
{钻机手}倒地了！

第 93 回合 ---------------------------------------------
{侦察兵}发起了 1 点攻击
{大自爆虫}受到了 1 点伤害，当前血量为 80
{大自爆虫}发起了 19 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 100

第 94 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 76
{大自爆虫}发起了 17 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 100

第 95 回合 ---------------------------------------------
{侦察兵}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 70
{大自爆虫}发起了 9 点攻击
{侦察兵}受到了 9 点伤害，当前血量为 91

第 96 回合 ---------------------------------------------
{侦察兵}发起了 9 点攻击
{大自爆虫}受到了 9 点伤害，当前血量为 61
{大自爆虫}发起了 29 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 91

第 97 回合 ---------------------------------------------
{侦察兵}发起了 0 点攻击
{大自爆虫}受到了 0 点伤害，当前血量为 61
{大自爆虫}发起了 14 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 91

第 98 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 57
{大自爆虫}发起了 7 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 91

第 99 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 53
{大自爆虫}发起了 4 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 91

第 100 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 49
{大自爆虫}发起了 27 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 91

第 101 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 45
{大自爆虫}发起了 24 点攻击
{侦察兵}受到了 24 点伤害，当前血量为 67

第 102 回合 ---------------------------------------------
{侦察兵}发起了 9 点攻击
{大自爆虫}受到了 9 点伤害，当前血量为 36
{大自爆虫}发起了 13 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 67

第 103 回合 ---------------------------------------------
{侦察兵}发起了 9 点攻击
{大自爆虫}受到了 9 点伤害，当前血量为 27
{大自爆虫}发起了 17 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 67

第 104 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 23
{大自爆虫}发起了 8 点攻击
{侦察兵}受到了 8 点伤害，当前血量为 59

第 105 回合 ---------------------------------------------
{侦察兵}发起了 3 点攻击
{大自爆虫}受到了 3 点伤害，当前血量为 20
{大自爆虫}发起了 26 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 59

第 106 回合 ---------------------------------------------
{侦察兵}发起了 2 点攻击
{大自爆虫}受到了 2 点伤害，当前血量为 18
{大自爆虫}发起了 8 点攻击
{侦察兵}受到了 8 点伤害，当前血量为 51

第 107 回合 ---------------------------------------------
{侦察兵}发起了 4 点攻击
{大自爆虫}受到了 4 点伤害，当前血量为 14
{大自爆虫}发起了 12 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 51

第 108 回合 ---------------------------------------------
{侦察兵}发起了 3 点攻击
{大自爆虫}受到了 3 点伤害，当前血量为 11
{大自爆虫}发起了 24 点攻击
{侦察兵}受到了 24 点伤害，当前血量为 27

第 109 回合 ---------------------------------------------
{侦察兵}发起了 6 点攻击
{大自爆虫}受到了 6 点伤害，当前血量为 5
{大自爆虫}发起了 23 点攻击
{侦察兵}受到了 0 点伤害，当前血量为 27

第 110 回合 ---------------------------------------------
{侦察兵}发起了 8 点攻击
{大自爆虫}受到了 8 点伤害，当前血量为 -3
{大自爆虫}死亡了！

Win！

Process finished with exit code 0

'''