＃译文<1>
名称 =  输入（“请输入姓名：”）
性别 =  输入（“请输入性别：”）
年龄 =  输入（“请输入年龄：”）
dic  = {}
dic。更新（{{ “ name”：名称，“ gender”：性别，“ age”：年龄 }）
＃译文<2>
打印（“我的名字{}，今年{}岁，性别{}，喜欢敲代码”。格式（DIC [ “名称” ]，DIC [ “性别” ]，DIC [ “年龄” ]））
＃译文<3>
高 =  输入（“请输入您的身高：”）
mobil_phone  =  input（“请输入您的联系方式：”）
dic。更新（{ “ high”：high，“ mobil_phone”：mobil_phone }）
＃译文<4>
用于 ķ  在 DIC：
    打印（str（k）+ '：' + str（dic [ k ]））
＃译文<5>
李 = [ 11，22，33，22，22，44，55，77，88，99，11 ]
s  =  设定（li）
李 =  列表（小号）
打印（“元素的数量有：” + str（len（li）））
＃译文<6>
列表= [ 1，2，3，4，5，6，7，8，9 ]
打印（list [ 2 :: 3 ]）
＃译文<7>
s  =  'python java php'
打印（小号 [ 7：11 ]）